In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\AKASH\\Downloads\\data_dev_script.csv")

In [3]:
schema_df = pd.read_csv("C:\\Users\\AKASH\\Downloads\\survey_results_schema.csv")

In [4]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [5]:
df1 = pd.DataFrame(people)

In [6]:
df1

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [7]:
df1['first'] + " " + df1['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [8]:
df1['full_name'] = df1['first'] + " " + df1["last"]

In [9]:
df1

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [11]:
df1.drop(columns = ['first' , 'last'] , inplace = True)

In [12]:
df1

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [13]:
df1['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [14]:
df1['full_name'].str.split(' ' , expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [16]:
df1[["first" , "last"]] = df1['full_name'].str.split(' ' , expand = True)

In [17]:
df1

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [19]:
people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["IronMan@avenge.com", 'Cap@avenge.com']
}

In [20]:
df2 = pd.DataFrame(people)

In [21]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [22]:
df1.append(df2 , ignore_index = True)

C:\Users\AKASH\AppData\Local\Temp\ipykernel_17948\2988702420.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2 , ignore_index = True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [36]:
df3 = df1.append(df2 ,ignore_index = True ,  sort = False)

C:\Users\AKASH\AppData\Local\Temp\ipykernel_17948\183800894.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2 ,ignore_index = True ,  sort = False)

In [37]:
df3

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [38]:
df3.drop(index = 4 )

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [44]:
df3.columns

Index(['email', 'full_name', 'first', 'last'], dtype='object')

In [51]:
df3.drop(index = df3[df3['last'] == 'Doe'].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [53]:
filt = df3['last'] == 'Doe'
df3.drop(index = df3[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers